app/services/subscription_service.rb

UPDATE "subscriptions" SET "status" = $1, "updated_at" = $2 WHERE "subscriptions"."id" = $3  [["status", 1], ["updated_at", "2024-09-30 10:58:47.382339"], ["id", 1]]
---
  def update(params)
    return false unless subscription

    begin
      if subscription.update(params)

INSERT INTO "subscriptions" ("title", "price", "status", "frequency", "customer_id", "tea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def save_subscription
    if subscription.save