app/controllers/api/v1/subscriptions_controller.rb

DELETE FROM "subscriptions" WHERE "subscriptions"."id" = $1  [["id", 1]]
---
  def destroy
    subscription_service = SubscriptionService.new(@customer, @subscription)
    if subscription_service.destroy