app/controllers/api/v1/subscriptions_controller.rb

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("title", "price", "status", "frequency", "customer_id", "tea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    tea = Tea.find_by(id: params[:tea_id])
    if tea.nil?
      render json: { error: 'Tea not found' }, status: :not_found
      return
    end

    subscription = @customer.subscriptions.new(subscription_params.merge(tea: tea))

    if subscription.save

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."customer_id" = $1 AND "subscriptions"."id" = $2 LIMIT $3  [["customer_id", 152], ["id", 174], ["LIMIT", 1]]
---
  def show
    subscription = @customer.subscriptions.find(params[:id])

UPDATE "subscriptions" SET "status" = $1, "updated_at" = $2 WHERE "subscriptions"."id" = $3  [["status", 1], ["updated_at", "2024-09-28 10:11:25.879437"], ["id", 7]]
---
  def update
    begin
      if @subscription.update(subscription_params)

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 174], ["LIMIT", 1]]
---
  def set_customer
    @customer = Customer.find(params[:customer_id])

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."customer_id" = $1 AND "subscriptions"."id" = $2 LIMIT $3  [["customer_id", 174], ["id", 198], ["LIMIT", 1]]
---
  def set_subscription
    @subscription = @customer.subscriptions.find(params[:id])